Revit 2026 API

# MechanicalEquipmentSetCreate Method

---
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static MechanicalEquipmentSet Create(
	Document document,
	ElementId typeId,
	ISet<ElementId> memberIds
)
```
```vb
Public Shared Function Create (
	document As Document,
	typeId As ElementId,
	memberIds As ISet(Of ElementId)
) As MechanicalEquipmentSet
```
```cpp
public:
static MechanicalEquipmentSet^ Create(
	Document^ document,
	ElementId^ typeId,
	ISet<ElementId^>^ memberIds
)
```
```fsharp
static member Create :
        document : Document *
        typeId : ElementId *
        memberIds : ISet<ElementId> -> MechanicalEquipmentSet
```

#### Parameters

document Document

typeId ElementId

memberIds ISetElementId

#### Return Value

MechanicalEquipmentSet

#### Reference

MechanicalEquipmentSet Class

Autodesk.Revit.DB.Mechanical Namespace